[
  {
    "id": 1,
    "title": "Corne MX Galaxy Black",
    "description": "The Corne MX Galaxy Black is a sleek split mechanical keyboard designed for portability and comfort. Its compact layout reduces finger travel while maintaining full programmability, and the galaxy-inspired black finish gives it a premium look. Perfect for enthusiasts who want a small, ergonomic keyboard without sacrificing style or functionality.",
    "price": "$130.00",
    "imageSrc": "../../assets/images/keyboards-images/corne-mx-galaxy-black.png"
  },
  {
    "id": 2,
    "title": "Corne MX Snake",
    "description": "The Corne MX Snake offers a bold and unique design with a striking snake pattern that stands out from traditional boards. Built with the same split ergonomic layout as other Corne keyboards, it delivers comfort during long sessions, while the custom artwork makes it a centerpiece on any desk. Ideal for users who enjoy both practicality and distinctive aesthetics.",
    "price": "$120.00",
    "imageSrc": "../../assets/images/keyboards-images/corne-snake.jpg"
  },
  {
    "id": 3,
    "title": "Lily 58 Fire Dark",
    "description": "The Lily 58 Fire Dark combines an ergonomic split layout with a dramatic black-and-red color scheme. Its 58 keys provide a balance between minimalism and accessibility, making it easy to customize while still offering plenty of functionality. The fiery red accents create a bold look for those who want performance and personality in one package.",
    "price": "$160.00",
    "imageSrc": "../../assets/images/keyboards-images/lily58-black-red.jpeg"
  },
  {
    "id": 4,
    "title": "Lily 58 Electric",
    "description": "The Lily 58 Electric is an ergonomic split keyboard with a vibrant black-and-yellow theme that gives it an energetic, modern appearance. With fully programmable keys and a comfortable staggered layout, it offers a smooth typing experience tailored to your needs. The striking color palette makes it a great choice for builders who want both usability and style.",
    "price": "$160.00",
    "imageSrc": "../../assets/images/keyboards-images/lily58-black-yellow.jpeg"
  },
  {
    "id": 5,
    "title": "Corne MX RGB",
    "description": "The Corne MX RGB brings the popular split layout to life with customizable per-key RGB lighting. Its compact size makes it easy to carry while still offering full programmability for macros and layouts. Perfect for users who value both portability and a colorful, dynamic typing experience that stands out in any setup.",
    "price": "$79.99",
    "imageSrc": "../../assets/images/keyboards-images/corne-mx.jpeg"
  },
  {
    "id": 6,
    "title": "Lily 58 Low",
    "description": "The Lily 58 Low is a slimmed-down version of the Lily split keyboard, designed for a flatter profile and easier portability. With its ergonomic 58-key layout, it maintains comfort while reducing bulk, making it a great option for travel or minimalist desk setups. Its sleek design is perfect for users who want practicality without compromise.",
    "price": "$150.00",
    "imageSrc": "../../assets/images/keyboards-images/glamour-2.jpeg"
  },
  {
    "id": 7,
    "title": "Keychron",
    "description": "Keychron keyboards are known for their versatility, offering wireless connectivity, hot-swappable switches, and modern layouts that appeal to both casual users and enthusiasts. This model combines reliability with style, featuring a sturdy build and subtle design that fits into any workspace. Ideal for professionals who want performance and convenience in a single board.",
    "price": "$119.99",
    "imageSrc": "../../assets/images/keyboards-images/keychron-keyboard.webp"
  },
  {
    "id": 8,
    "title": "Royal Kludge",
    "description": "The Royal Kludge mechanical keyboard delivers excellent value with its balance of features and affordability. Known for its wireless support and vibrant backlighting, it’s a versatile board suited for gaming, productivity, or casual typing. Its compact build and modern design make it an accessible entry point into the mechanical keyboard world.",
    "price": "$99.99",
    "imageSrc": "../../assets/images/keyboards-images/royal-kludge.jpg"
  }
]
